niketic95/microzig/port/silabs/efr32fg23x/src/chips/EFR32FG23B010F512IM48.svd
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x07000040</resetValue>
          <resetMask>0x8707FF7D</resetMask>
          <fields>
            <field>
              <name>BUFOUTFREEZE</name>
              <description>Freeze BUFOUT Controls</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEEPWARM</name>
              <description>Keep Warm</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM23ONDEMAND</name>
              <description>On-demand During EM23</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEXI2GNDANA</name>
              <description>Force XI Pin to Ground</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled (not pulled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled (pulled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEXO2GNDANA</name>
              <description>Force XO Pin to Ground</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled (not pulled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled (pulled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCECTUNEMAX</name>
              <description>Force Tuning Cap to Max Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSSTATUSSEL0</name>
              <description>PRS Status 0 Output Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>PRS mux outputs 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENS</name>
                  <description>PRS mux outputs enabled status</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COREBIASOPTRDY</name>
                  <description>PRS mux outputs core bias optimization ready status</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY</name>
                  <description>PRS mux outputs ready status</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSRDY</name>
                  <description>PRS mux outputs PRS ready status</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFOUTRDY</name>
                  <description>PRS mux outputs BUFOUT ready status</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWREQ</name>
                  <description>PRS mux outputs oscillator requested by digital clock status</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSHWREQ</name>
                  <description>PRS mux outputs oscillator requested by PRS request status</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFOUTHWREQ</name>
                  <description>PRS mux outputs oscillator requested by BUFOUT request status</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSSTATUSSEL1</name>
              <description>PRS Status 1 Output Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>PRS mux outputs 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENS</name>
                  <description>PRS mux outputs enabled status</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COREBIASOPTRDY</name>
                  <description>PRS mux outputs core bias optimization ready status</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY</name>
                  <description>PRS mux outputs ready status</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSRDY</name>
                  <description>PRS mux outputs PRS ready status</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFOUTRDY</name>
                  <description>PRS mux outputs BUFOUT ready status</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWREQ</name>
                  <description>PRS mux outputs oscillator requested by digital clock status</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSHWREQ</name>
                  <description>PRS mux outputs oscillator requested by PRS request status</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFOUTHWREQ</name>
                  <description>PRS mux outputs oscillator requested by BUFOUT request status</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEEN</name>
              <description>Force Digital Clock Request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEENPRS</name>
              <description>Force PRS Oscillator Request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEENBUFOUT</name>
              <description>Force BUFOUT Request</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISONDEMAND</name>
              <description>Disable On-demand For Digital Clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISONDEMANDPRS</name>
              <description>Disable On-demand For PRS</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISONDEMANDBUFOUT</name>
              <description>Disable On-demand For BUFOUT</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFOUTTRIM</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>VTRTRIMANA</name>
              <description>BUFOUT Reference Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
