niketic95/microzig/port/silabs/efr32fg23x/src/chips/EFR32FG23B010F512IM48.svd
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x074</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF830800F</resetMask>
          <fields>
            <field>
              <name>RDY</name>
              <description>Digital Clock Ready Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COREBIASOPTRDY</name>
              <description>Core Bias Optimization Ready Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSRDY</name>
              <description>PRS Ready Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFOUTRDY</name>
              <description>BUFOUT Ready Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFOUTFROZEN</name>
              <description>BUFOUT FROZEN Interrupt</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSERR</name>
              <description>PRS Requset Error Interrupt</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFOUTERR</name>
              <description>BUFOUT Request Error Interrupt</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFOUTFREEZEERR</name>
              <description>BUFOUT Freeze Error Interrupt</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFOUTDNSERR</name>
              <description>BUFOUT Did Not Start Error Interrupt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNSERR</name>
              <description>Did Not Start Error Interrupt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFTIMEOUTERR</name>
              <description>Low Frequency Timeout Error Interrupt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COREBIASOPTERR</name>
              <description>Core Bias Optimization Error Interrupt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>No Description</description>
          <addressOffset>0x080</addressOffset>
          <access>write-only</access>
          <resetValue>0x0000580E</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LOCKKEY</name>
              <description>Configuration Lock Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Write this value to unlock</description>
                  <value>22542</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HOSTMAILBOX_NS</name>
      <version>0</version>
      <description>HOSTMAILBOX_NS Registers</description>
      <baseAddress>0x50098000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HOSTMAILBOX</name>
        <value>39</value>
      </interrupt>
      <registers>
        <register>
          <name>MSGPTR0</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTR</name>
              <description>Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSGPTR1</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTR</name>
              <description>Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSGPTR2</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTR</name>
              <description>Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSGPTR3</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTR</name>
              <description>Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>MBOXIF0</name>
              <description>Mailbox Interupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBOXIF1</name>
              <description>Mailbox Interupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBOXIF2</name>
              <description>Mailbox Interupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBOXIF3</name>
              <description>Mailbox Interupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>MBOXIEN0</name>
              <description>Mailbox Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBOXIEN1</name>
              <description>Mailbox Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBOXIEN2</name>
              <description>Mailbox Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBOXIEN3</name>
              <description>Mailbox Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
