niketic95/microzig/port/silabs/efr32fg23x/src/chips/EFR32FG23B010F512IM48.svd
        <register>
          <name>TOP</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>TOP</name>
              <description>Counter Top Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOPB</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>TOPB</name>
              <description>Counter Top Buffer Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVSCTRL</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000010FF</resetMask>
          <fields>
            <field>
              <name>FILTLEN</name>
              <description>Configure Filter Length for Inputs S0IN </description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLUTTERRM</name>
              <description>Flutter Remove</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>No Description</description>
          <addressOffset>0x038</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>CTRL</name>
              <description>CTRL Register Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>CMD Register Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOP</name>
              <description>TOP Register Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOPB</name>
              <description>TOPB Register Busy</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVSCTRL</name>
              <description>OVSCTRL Register Busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>No Description</description>
          <addressOffset>0x03C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>PCNTLOCKKEY</name>
              <description>Configuration Lock Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Write to unock PCNT lockable registers</description>
                  <value>42976</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PFMXPPRF_NS</name>
      <version>0</version>
      <description>PFMXPPRF_NS Registers</description>
      <baseAddress>0x500C4000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RFIMDCDCCTRL0</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000003</resetMask>
          <fields>
            <field>
              <name>TXMAXREQ</name>
              <description>TX Max Req</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPPREQ</name>
              <description>RX PP Req</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIMDCDCCTRL1</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000014</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>DCDCDIVEN</name>
              <description>DCDC DIV Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDCDIVINVEN</name>
              <description>DCDC DIV Inverter Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDCDIVRATIO</name>
              <description>DCDC DIV Ratio</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVRATIO8</name>
                  <description>Dividing master_rf clk by 8, D=50%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO9</name>
                  <description>Dividing master_rf clk by 9, D=44.4%</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO10</name>
                  <description>Dividing master_rf clk by 10, D=40%</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO11</name>
                  <description>Dividing master_rf clk by 11, D=36.4%</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO12</name>
                  <description>Dividing master_rf clk by 12, D=50%</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO13</name>
                  <description>Dividing master_rf clk by 13, D=46.2%</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO14</name>
                  <description>Dividing master_rf clk by 14, D=42.9%</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO15</name>
                  <description>Dividing master_rf clk by 15, D=40%</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO16</name>
                  <description>Dividing master_rf clk by 16, D=50%</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO17</name>
                  <description>Dividing master_rf clk by 17, D=47.1%</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO18</name>
                  <description>Dividing master_rf clk by 18, D=44.4%</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO19</name>
                  <description>Dividing master_rf clk by 19, D=42.1%</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO20</name>
                  <description>Dividing master_rf clk by 20, D=60%</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO21</name>
                  <description>Dividing master_rf clk by 21, D=57.1%</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO22</name>
                  <description>Dividing master_rf clk by 22, D=54.5%</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVRATIO23</name>
                  <description>Dividing master_rf clk by 23, D=52.2%</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIMDCDCCTRL2</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x0AD0B4A0</resetValue>
          <resetMask>0x9FFFFFFF</resetMask>
          <fields>
            <field>
              <name>PPTMAX</name>
              <description>Pulse Pairing Time Max</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPTMIN</name>
              <description>Pulse Pairing Time Min</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPND</name>
              <description>Pulse Pairing Period</description>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPCALEN</name>
              <description>Pulse Pairing Calibration Loop Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPSYNCONLY</name>
              <description>Pulse Pairing Sync Only</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIMDCDCSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FF07</resetMask>
          <fields>
            <field>
              <name>DCDCEN</name>
              <description>DCDC Enable Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXMAXSTATUS</name>
              <description>TX MAX Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXPPSTATUS</name>
              <description>RX PP Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WNO1</name>
              <description>Cal Loop WNO1 value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPURATD0</name>
          <description>Protected register address = (RPURATD register index X 32 + RPURATD bit index) X 4.</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>RATDRFIMDCDCCTRL0</name>
              <description>RFIMDCDCCTRL0 Protection Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RATDRFIMDCDCCTRL1</name>
              <description>RFIMDCDCCTRL1 Protection Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RATDRFIMDCDCCTRL2</name>
              <description>RFIMDCDCCTRL2 Protection Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
