niketic95/microzig/port/silabs/efr32fg23x/src/chips/EFR32FG23B010F512IM48.svd
        <register>
          <name>BMPUPATD0</name>
          <description>Set master bits to 1 to mark as a privileged master</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>RADIOAES</name>
              <description>RADIO AES DMA privileged mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIOSUBSYSTEM</name>
              <description>RADIO subsystem manager privileged mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDMA</name>
              <description>MCU LDMA privileged mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFECA0</name>
              <description>RFECA0 privileged mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFECA1</name>
              <description>RFECA1 privileged mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEEXTDMA</name>
              <description>SEEXTDMA privileged mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMPUSATD0</name>
          <description>Set master bits to 1 to mark as a secure master</description>
          <addressOffset>0x170</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>RADIOAES</name>
              <description>RADIOAES DMA secure mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIOSUBSYSTEM</name>
              <description>RADIO subsystem manager secure mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDMA</name>
              <description>MCU LDMA secure mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFECA0</name>
              <description>RFECA0 secure mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFECA1</name>
              <description>RFECA1 secure mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEEXTDMA</name>
              <description>SEEXTDMA secure mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMPUFS</name>
          <description>No Description</description>
          <addressOffset>0x250</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>BMPUFSMASTERID</name>
              <description>Bus Manager ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMPUFSADDR</name>
          <description>No Description</description>
          <addressOffset>0x254</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BMPUFSADDR</name>
              <description>Fault Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAURTYPES0</name>
          <description>No Description</description>
          <addressOffset>0x260</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001000</resetMask>
          <fields>
            <field>
              <name>ESAUR3NS</name>
              <description>Region 3 Non-Secure</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAURTYPES1</name>
          <description>No Description</description>
          <addressOffset>0x264</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001000</resetMask>
          <fields>
            <field>
              <name>ESAUR11NS</name>
              <description>Region 11 Non-Secure</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAUMRB01</name>
          <description>No Description</description>
          <addressOffset>0x270</addressOffset>
          <access>read-write</access>
          <resetValue>0x0A000000</resetValue>
          <resetMask>0x0FFFF000</resetMask>
          <fields>
            <field>
              <name>ESAUMRB01</name>
              <description>Moveable Region Boundary</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAUMRB12</name>
          <description>No Description</description>
          <addressOffset>0x274</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C000000</resetValue>
          <resetMask>0x0FFFF000</resetMask>
          <fields>
            <field>
              <name>ESAUMRB12</name>
              <description>Moveable Region Boundary</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAUMRB45</name>
          <description>No Description</description>
          <addressOffset>0x280</addressOffset>
          <access>read-write</access>
          <resetValue>0x02000000</resetValue>
          <resetMask>0x0FFFF000</resetMask>
          <fields>
            <field>
              <name>ESAUMRB45</name>
              <description>Moveable Region Boundary</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAUMRB56</name>
          <description>No Description</description>
          <addressOffset>0x284</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <resetMask>0x0FFFF000</resetMask>
          <fields>
            <field>
              <name>ESAUMRB56</name>
              <description>Moveable Region Boundary</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
